#+SETUPFILE: theme-readtheorg.setup
#+TITLE:       Basic calculations
#+AUTHOR:      Tabrez Iqbal
#+Description: This document catalogs a set of tables showing the effect of inflation and returns.
#+LANGUAGE:    en

* Effect of Inflation and positive returns on your savings

** Effect of inflation on present value

#+BEGIN_SRC python :session :exports both
import tabulate as tb
from returns import *
try_inflation_adjusted(100000)
#+END_SRC

#+RESULTS:
:   Years New Value
: 0     7   ₹55.78K
: 1    14   ₹31.12K
: 2    21   ₹17.36K
: 3    28    ₹9.68K
: 4    35    ₹5.40K
: 5    42    ₹3.01K

** What will be the value of your corpus if you save 10K monthly?

#+BEGIN_SRC python :session :exports results :output value table
tb.tabulate(try_future_values(10000), headers='keys', tablefmt='orgtbl')
#+END_SRC

#+RESULTS:
#+begin_example
|    |   Years | Final Amount   |
|----+---------+----------------|
|  0 |       5 | ₹7.81L         |
|  1 |      10 | ₹20.66L        |
|  2 |      15 | ₹41.79L        |
|  3 |      20 | ₹76.57L        |
|  4 |      25 | ₹1.34Cr        |
|  5 |      30 | ₹2.28Cr        |
|  6 |      35 | ₹3.83Cr        |
|  7 |      40 | ₹6.38Cr        |
#+end_example

** How many times does your invested amount increase?
#+BEGIN_SRC python :session :exports results
tb.tabulate(try_future_values_df(10000), headers='keys', tablefmt='orgtbl')
#+END_SRC

#+RESULTS:
#+begin_example
|    |   Years | Invested Amount   | Returns Amount   | Final Amount   |   Times Increased |
|----+---------+-------------------+------------------+----------------+-------------------|
|  0 |       5 | ₹6.00L            | ₹1.81L           | ₹7.81L         |              1.3  |
|  1 |      10 | ₹12.00L           | ₹8.66L           | ₹20.66L        |              1.72 |
|  2 |      15 | ₹18.00L           | ₹23.79L          | ₹41.79L        |              2.32 |
|  3 |      20 | ₹24.00L           | ₹52.57L          | ₹76.57L        |              3.19 |
|  4 |      25 | ₹30.00L           | ₹1.04Cr          | ₹1.34Cr        |              4.46 |
|  5 |      30 | ₹36.00L           | ₹1.92Cr          | ₹2.28Cr        |              6.33 |
|  6 |      35 | ₹42.00L           | ₹3.41Cr          | ₹3.83Cr        |              9.11 |
|  7 |      40 | ₹48.00L           | ₹5.90Cr          | ₹6.38Cr        |             13.28 |
#+end_example

** How does the corpus value change using different investment instruments?

#+BEGIN_SRC python :session :exports results
tb.tabulate(try_future_values_diff_rates(10000), headers='keys', tablefmt='orgtbl')
#+END_SRC

#+RESULTS:
: |    |   Years | Invested Amount   | -8      | 3.5     | 4.62    | 5.6     | 7       | 7.5     | 10      |
: |----+---------+-------------------+---------+---------+---------+---------+---------+---------+---------|
: |  0 |      10 | ₹12.00L           | ₹8.22L  | ₹14.39L | ₹15.28L | ₹16.11L | ₹17.41L | ₹17.90L | ₹20.66L |
: |  1 |      20 | ₹24.00L           | ₹11.91L | ₹34.79L | ₹39.50L | ₹44.28L | ₹52.40L | ₹55.72L | ₹76.57L |
